lib/tasks/create_demo_data.rake

  task :create_demo_data => :environment do

  	puts "resetting database"
		Administrator.destroy_all
		Label.destroy_all
		Genre.destroy_all
		Album.destroy_all
		AlbumGenre.destroy_all
		Artist.destroy_all
		Track.destroy_all




		# Admins
		puts "created admins..."
		generic_pw = 'Password123!'

		Administrator.create!({
			first_name: 'Dan',
			last_name: 'Shores',
			email: 'dshores@sonoluminus.com',
			password: generic_pw,
			password_confirmation: generic_pw
		})

		Administrator.create!({
			first_name: 'Eric',
			last_name: 'Oligney',
			email: 'eoengineer@gmail.com',
			password: generic_pw,
			password_confirmation: generic_pw
		})

		puts "creating artists"
		@artists = Artist.create!(DataFactory::Artists.manifest(10))

		puts "creating labels"
		@labels = Label.create!(DataFactory::Labels.manifest)

		puts "creating genres"
		@genres = Genre.create!(DataFactory::Genres.manifest)
---
DELETE FROM "administrators" WHERE "administrators"."id" = ?  [["id", 1]]
DELETE FROM "labels" WHERE "labels"."id" = ?  [["id", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]
INSERT INTO "administrators" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "artists" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "The Roob Experience"], ["created_at", "2018-02-19 03:00:30.025945"], ["updated_at", "2018-02-19 03:00:30.025945"]]
INSERT INTO "labels" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Geffen"], ["created_at", "2018-02-19 03:01:52.380117"], ["updated_at", "2018-02-19 03:01:52.380117"]]
INSERT INTO "genres" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Rock"], ["created_at", "2018-02-19 03:01:52.410556"], ["updated_at", "2018-02-19 03:01:52.410556"]]

				@album.artist = artist
				@album.label  = @labels.to_a[i]
				@album.album_genres.build(genre: @genres.take(1).first)
				@album.save!
---
INSERT INTO "album_genres" ("album_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["album_id", 1], ["genre_id", 81], ["created_at", "2018-02-19 03:12:48.155558"], ["updated_at", "2018-02-19 03:12:48.155558"]]
INSERT INTO "albums" ("title", "description", "release_date", "artist_id", "label_id", "available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)