app/controllers/admin/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY "albums"."title" ASC
---
	def index
		@columns = get_columns
		@albums  = Album.order(title: :asc)