app/controllers/admin/albums_controller.rb

	def index
		@resource_name  	 = "Albums"
		@columns 			  	 = get_columns
		@current_page   	 = params[:current_page].try(:to_i) || 1
		@per_page 		  	 = params[:per_page].try(:to_i) || 10
		@sort_field		  	 = params[:sort_field] || 'id'
		joined_sort_field  = handle_associated_sort
		@sort_direction    = params[:sort_direction] || 'asc'

		@albums  			     = Album.all
		@total_count	 		 = @albums.count
---
SELECT COUNT(*) FROM "albums"