app/controllers/admin/base_controller.rb

  def current_user
      @current_user ||= Administrator.find(session[:admin]["current_user_id"]) if session[:admin] && session[:admin]["current_user_id"]
---
SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]