app/controllers/admin/sessions_controller.rb

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."email" = ? LIMIT ?  [["email", "eoengineer@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = Administrator.find_by(email: params[:session][:email])